mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
/**
 * @file uart.c
 * @brief UART驱动模块实现
 * @version 1.0.0
 * @date 2024-01-01
 * @details 基于STM32标准外设库的UART驱动，支持UART1/2/3，阻塞式发送/接收，可配置波特率、数据位、停止位、校验位
 */

/* Include config.h first to get module enable flags */
#include "config.h"

#if CONFIG_MODULE_UART_ENABLED

/* Include our header */
#include "uart.h"

#include "gpio.h"
#include "delay.h"
#include "nvic.h"
#ifdef CONFIG_MODULE_DMA_ENABLED
#if CONFIG_MODULE_DMA_ENABLED
#include "dma.h"
#endif
#endif
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"
#include "misc.h"
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

/* 从board.h加载配置 */
static UART_Config_t g_uart_configs[UART_INSTANCE_MAX] = UART_CONFIGS;

/* 初始化标志 */
static bool g_uart_initialized[UART_INSTANCE_MAX] = {false, false, false};

/* 硬件流控配置 */
static UART_HW_FlowControl_t g_uart_hw_flow[UART_INSTANCE_MAX] = {UART_HW_FLOW_NONE, UART_HW_FLOW_NONE, UART_HW_FLOW_NONE};

/* 单线半双工模式标志 */
static bool g_uart_half_duplex[UART_INSTANCE_MAX] = {false, false, false};

/* 默认超时时间（毫秒） */
#define UART_DEFAULT_TIMEOUT_MS  1000

/* 中断回调函数数组 */
static UART_IT_Callback_t g_uart_it_callbacks[UART_INSTANCE_MAX][8] = {NULL};
static void *g_uart_it_user_data[UART_INSTANCE_MAX][8] = {NULL};

/* 中断模式发送/接收缓冲区 */
static const uint8_t *g_uart_tx_buffer[UART_INSTANCE_MAX] = {NULL};
static uint8_t *g_uart_rx_buffer[UART_INSTANCE_MAX] = {NULL};
static uint16_t g_uart_tx_length[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_tx_index[UART_INSTANCE_MAX] = {0};
/* g_uart_rx_length 保留用于未来扩展，当前未使用 */
#if 0
static uint16_t g_uart_rx_length[UART_INSTANCE_MAX] = {0};
#endif
static uint16_t g_uart_rx_index[UART_INSTANCE_MAX] = {0};
static uint16_t g_uart_rx_max_length[UART_INSTANCE_MAX] = {0};

/* DMA通道映射（UART TX/RX对应的DMA通道） */
#if CONFIG_MODULE_DMA_ENABLED
static const DMA_Channel_t uart_tx_dma_channels[UART_INSTANCE_MAX] = {
    DMA_CHANNEL_1_1,  /* UART1 TX -> DMA1_CH1 */
    DMA_CHANNEL_1_3,  /* UART2 TX -> DMA1_CH3 */
    DMA_CHANNEL_1_5,  /* UART3 TX -> DMA1_CH5 */
};

static const DMA_Channel_t uart_rx_dma_channels[UART_INSTANCE_MAX] = {
    DMA_CHANNEL_1_5,  /* UART1 RX -> DMA1_CH5 (STM32F103固定映射) */
    DMA_CHANNEL_1_4,  /* UART2 RX -> DMA1_CH4 */
    DMA_CHANNEL_1_6,  /* UART3 RX -> DMA1_CH6 */
};
#endif /* CONFIG_MODULE_DMA_ENABLED */

/**
 * @brief 获取UART外设时钟
 * @param[in] uart_periph UART外设指针
 * @return uint32_t 时钟使能值，失败返回0
 */
static uint32_t UART_GetPeriphClock(USART_TypeDef *uart_periph)
{
    if (uart_periph == USART1)
    {
        return RCC_APB2Periph_USART1;
    }
    else if (uart_periph == USART2)
    {
        return RCC_APB1Periph_USART2;
    }
    else if (uart_periph == USART3)
    {
        return RCC_APB1Periph_USART3;
    }
    return 0;
}

/**
 * @brief 获取UART GPIO时钟
 * @param[in] port GPIO端口指针
 * @return uint32_t GPIO时钟使能值
 */
static uint32_t UART_GetGPIOClock(GPIO_TypeDef *port)
{
    if (port == GPIOA)
    {
        return RCC_APB2Periph_GPIOA;
    }
    else if (port == GPIOB)
    {
        return RCC_APB2Periph_GPIOB;
    }
    else if (port == GPIOC)
    {
        return RCC_APB2Periph_GPIOC;
    }
    else if (port == GPIOD)
    {
        return RCC_APB2Periph_GPIOD;
    }
    else if (port == GPIOE)
    {
        return RCC_APB2Periph_GPIOE;
    }
    return 0;
}

/**
 * @brief 等待UART标志位
 * @param[in] uart_periph UART外设指针
 * @param[in] flag 标志位
 * @param[in] timeout_ms 超时时间（毫秒）
 * @return UART_Status_t 错误码
 */
static UART_Status_t UART_WaitFlag(USART_TypeDef *uart_periph, uint16_t flag, uint32_t timeout_ms)
{
    uint32_t start_tick = Delay_GetTick();
    
    while (USART_GetFlagStatus(uart_periph, flag) == RESET)
    {
        /* 检查超时（使用Delay_GetElapsed处理溢出） */
        uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
        if (elapsed > timeout_ms)
        {
            return UART_ERROR_TIMEOUT;
        }
        
        /* 检查错误标志 */
        uint16_t sr = uart_periph->SR;

        /* 等待发送完成时，丢弃RS485回波/噪声，避免误报ORE */
        if (flag != USART_FLAG_RXNE) {
            if ((sr & USART_FLAG_RXNE) != RESET) {
                (void)USART_ReceiveData(uart_periph);
                continue;
            }
            if ((sr & USART_FLAG_ORE) != RESET) {
                (void)USART_ReceiveData(uart_periph);
                continue;
            }
        }

        if (sr & USART_FLAG_ORE)
        {
            /* 清除ORE标志：读取SR寄存器，然后读取DR寄存器 */
            (void)USART_ReceiveData(uart_periph);
            return UART_ERROR_ORE;
        }
        if (sr & USART_FLAG_NE)
        {
            /* 清除NE标志：读取SR寄存器，然后读取DR寄存器 */
            (void)USART_ReceiveData(uart_periph);
            return UART_ERROR_NE;
        }
        if (sr & USART_FLAG_FE)
        {
            /* 清除FE标志：读取SR寄存器，然后读取DR寄存器 */
            (void)USART_ReceiveData(uart_periph);
            return UART_ERROR_FE;
        }
        if (sr & USART_FLAG_PE)
        {
            /* 清除PE标志：读取SR寄存器，然后读取DR寄存器 */
            (void)USART_ReceiveData(uart_periph);
            return UART_ERROR_PE;
        }
    }
    
    return UART_OK;
}

/**
 * @brief UART初始化
 */
UART_Status_t UART_Init(UART_Instance_t instance)
{
    USART_InitTypeDef USART_InitStructure;
    GPIO_InitTypeDef GPIO_InitStructure;
    uint32_t uart_clock;
    uint32_t gpio_clock;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    if (!g_uart_configs[instance].enabled) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    if (g_uart_configs[instance].uart_periph == NULL) {
        return UART_ERROR_INVALID_PERIPH;
    }
    
    /* 检查是否已初始化 */
    if (g_uart_initialized[instance]) {
        return UART_OK;
    }
    
    /* 获取UART外设时钟 */
    uart_clock = UART_GetPeriphClock(g_uart_configs[instance].uart_periph);
    if (uart_clock == 0) {
        return UART_ERROR_INVALID_PERIPH;
    }
    
    /* 使能UART外设时钟 */
    if (g_uart_configs[instance].uart_periph == USART1) {
        RCC_APB2PeriphClockCmd(uart_clock, ENABLE);
    } else {
        RCC_APB1PeriphClockCmd(uart_clock, ENABLE);
    }
    
    /* 使能TX引脚GPIO时钟 */
    gpio_clock = UART_GetGPIOClock(g_uart_configs[instance].tx_port);
    if (gpio_clock == 0) {
        return UART_ERROR_GPIO_FAILED;
    }
    RCC_APB2PeriphClockCmd(gpio_clock, ENABLE);
    
    /* 使能RX引脚GPIO时钟（如果与TX不同） */
    if (g_uart_configs[instance].rx_port != g_uart_configs[instance].tx_port) {
        gpio_clock = UART_GetGPIOClock(g_uart_configs[instance].rx_port);
        if (gpio_clock == 0) {
            return UART_ERROR_GPIO_FAILED;
        }
        RCC_APB2PeriphClockCmd(gpio_clock, ENABLE);
    }
    
    /* 配置TX引脚为复用推挽输出 */
    GPIO_InitStructure.GPIO_Pin = g_uart_configs[instance].tx_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_Init(g_uart_configs[instance].tx_port, &GPIO_InitStructure);
    
    /* 配置RX引脚为浮空输入 */
    GPIO_InitStructure.GPIO_Pin = g_uart_configs[instance].rx_pin;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(g_uart_configs[instance].rx_port, &GPIO_InitStructure);
    
    /* 配置UART外设 */
    USART_InitStructure.USART_BaudRate = g_uart_configs[instance].baudrate;
    USART_InitStructure.USART_WordLength = g_uart_configs[instance].word_length;
    USART_InitStructure.USART_StopBits = g_uart_configs[instance].stop_bits;
    USART_InitStructure.USART_Parity = g_uart_configs[instance].parity;
    
