mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    /* 根据配置设置硬件流控 */
    switch (g_uart_hw_flow[instance]) {
        case UART_HW_FLOW_NONE:
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        case UART_HW_FLOW_RTS:
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        case UART_HW_FLOW_CTS:
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        case UART_HW_FLOW_RTS_CTS:
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        default:
            USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
    }
    
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    
    USART_Init(g_uart_configs[instance].uart_periph, &USART_InitStructure);
    
    /* 使能UART外设 */
    USART_Cmd(g_uart_configs[instance].uart_periph, ENABLE);
    
    /* 标记为已初始化 */
    g_uart_initialized[instance] = true;
    
    return UART_OK;
}

/**
 * @brief UART反初始化
 */
UART_Status_t UART_Deinit(UART_Instance_t instance)
{
    uint32_t uart_clock;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    
    if (!g_uart_initialized[instance]) {
        return UART_OK;
    }
    
    /* 禁用UART外设 */
    USART_Cmd(g_uart_configs[instance].uart_periph, DISABLE);
    
    /* 禁用所有UART中断 */
    USART_ITConfig(g_uart_configs[instance].uart_periph, 
                   USART_IT_TXE | USART_IT_TC | USART_IT_RXNE | USART_IT_IDLE |
                   USART_IT_PE | USART_IT_ERR | USART_IT_LBD | USART_IT_CTS, 
                   DISABLE);
    
    /* 清理中断模式状态 */
    g_uart_tx_buffer[instance] = NULL;
    g_uart_tx_length[instance] = 0;
    g_uart_tx_index[instance] = 0;
    g_uart_rx_buffer[instance] = NULL;
    /* g_uart_rx_length[instance] = 0; */ /* 保留用于未来扩展 */
    g_uart_rx_index[instance] = 0;
    g_uart_rx_max_length[instance] = 0;
    
#if CONFIG_MODULE_DMA_ENABLED
    /* 停止并清理DMA传输 */
    USART_DMACmd(g_uart_configs[instance].uart_periph, USART_DMAReq_Tx | USART_DMAReq_Rx, DISABLE);
    DMA_Stop(uart_tx_dma_channels[instance]);
    DMA_Stop(uart_rx_dma_channels[instance]);
#endif /* CONFIG_MODULE_DMA_ENABLED */
    
    /* 获取UART外设时钟 */
    uart_clock = UART_GetPeriphClock(g_uart_configs[instance].uart_periph);
    if (uart_clock != 0) {
        /* 禁用UART外设时钟 */
        if (g_uart_configs[instance].uart_periph == USART1) {
            RCC_APB2PeriphClockCmd(uart_clock, DISABLE);
        } else {
            RCC_APB1PeriphClockCmd(uart_clock, DISABLE);
        }
    }
    
    /* 标记为未初始化 */
    g_uart_initialized[instance] = false;
    
    return UART_OK;
}

/**
 * @brief UART发送数据（阻塞式）
 */
UART_Status_t UART_Transmit(UART_Instance_t instance, const uint8_t *data, uint16_t length, uint32_t timeout)
{
    USART_TypeDef *uart_periph;
    UART_Status_t status;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    actual_timeout = (timeout == 0) ? UART_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 发送数据 */
    /* 性能优化：对于大数据量，减少函数调用开销，直接检查标志位 */
    uint32_t start_tick = Delay_GetTick();
    for (i = 0; i < length; i++) {
        /* 等待发送数据寄存器为空（TXE标志） */
        /* 优化：直接检查标志位，减少函数调用 */
        while (USART_GetFlagStatus(uart_periph, USART_FLAG_TXE) == RESET) {
            /* 检查超时 */
            uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
            if (elapsed > actual_timeout) {
                return UART_ERROR_TIMEOUT;
            }

            /* 发送期间丢弃RX回波，避免RS485半双工误报ORE */
            {
                uint16_t sr = uart_periph->SR;
                if ((sr & USART_FLAG_RXNE) != RESET) {
                    (void)USART_ReceiveData(uart_periph);
                } else if ((sr & USART_FLAG_ORE) != RESET) {
                    (void)USART_ReceiveData(uart_periph);
                }
            }
        }
        
        /* 发送数据 */
        USART_SendData(uart_periph, data[i]);
    }
    
    /* 等待最后一个字节发送完成（TC标志） */
    status = UART_WaitFlag(uart_periph, USART_FLAG_TC, actual_timeout);
    if (status != UART_OK) {
        return status;
    }
    
    return UART_OK;
}

/**
 * @brief UART接收数据（阻塞式）
 */
UART_Status_t UART_Receive(UART_Instance_t instance, uint8_t *data, uint16_t length, uint32_t timeout)
{
    USART_TypeDef *uart_periph;
    uint16_t i;
    uint32_t actual_timeout;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    actual_timeout = (timeout == 0) ? UART_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 接收数据 */
    /* 性能优化：对于大数据量，减少函数调用开销，直接检查标志位 */
    uint32_t start_tick = Delay_GetTick();
    for (i = 0; i < length; i++) {
        /* 等待接收数据就绪（RXNE标志） */
        /* 优化：直接检查标志位，减少函数调用 */
        while (USART_GetFlagStatus(uart_periph, USART_FLAG_RXNE) == RESET) {
            /* 检查超时 */
            uint32_t elapsed = Delay_GetElapsed(Delay_GetTick(), start_tick);
            if (elapsed > actual_timeout) {
                return UART_ERROR_TIMEOUT;
            }
            
            /* 检查错误标志（快速检查） */
            uint16_t sr = uart_periph->SR;
            if (sr & (USART_FLAG_ORE | USART_FLAG_NE | USART_FLAG_FE | USART_FLAG_PE)) {
                /* 清除错误标志 */
                (void)USART_ReceiveData(uart_periph);
                if (sr & USART_FLAG_ORE) return UART_ERROR_ORE;
                if (sr & USART_FLAG_NE) return UART_ERROR_NE;
                if (sr & USART_FLAG_FE) return UART_ERROR_FE;
                if (sr & USART_FLAG_PE) return UART_ERROR_PE;
            }
        }
        
        /* 读取数据 */
        data[i] = (uint8_t)USART_ReceiveData(uart_periph);
    }
    
    return UART_OK;
}

/**
 * @brief 清空UART接收缓冲区
 */
UART_Status_t UART_FlushRx(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    uint16_t sr;

    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }

