mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (byte == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    actual_timeout = (timeout == 0) ? UART_DEFAULT_TIMEOUT_MS : timeout;
    
    /* 等待接收数据就绪（RXNE标志） */
    status = UART_WaitFlag(uart_periph, USART_FLAG_RXNE, actual_timeout);
    if (status != UART_OK) {
        return status;
    }
    
    /* 读取数据 */
    *byte = (uint8_t)USART_ReceiveData(uart_periph);
    
    return UART_OK;
}

/**
 * @brief UART发送字符串（阻塞式）
 */
UART_Status_t UART_TransmitString(UART_Instance_t instance, const char *str, uint32_t timeout)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (str == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 计算字符串长度并发送 */
    return UART_Transmit(instance, (const uint8_t *)str, strlen(str), timeout);
}

/**
 * @brief 检查UART是否已初始化
 */
uint8_t UART_IsInitialized(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0（未初始化） */
    }
    
    return g_uart_initialized[instance] ? 1 : 0;
}

/**
 * @brief 获取UART外设指针
 */
USART_TypeDef* UART_GetPeriph(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return NULL;  /* 无效实例返回NULL */
    }
    
    if (!g_uart_configs[instance].enabled) {
        return NULL;
    }
    
    return g_uart_configs[instance].uart_periph;
}

/* ========== 中断模式功能实现 ========== */

/**
 * @brief 获取UART中断类型对应的SPL库中断值
 */
static uint16_t UART_GetITValue(UART_IT_t it_type)
{
    switch (it_type) {
        case UART_IT_TXE:
            return USART_IT_TXE;
        case UART_IT_TC:
            return USART_IT_TC;
        case UART_IT_RXNE:
            return USART_IT_RXNE;
        case UART_IT_IDLE:
            return USART_IT_IDLE;
        case UART_IT_PE:
            return USART_IT_PE;
        case UART_IT_ERR:
            return USART_IT_ERR;
        case UART_IT_LBD:
            return USART_IT_LBD;
        case UART_IT_CTS:
            return USART_IT_CTS;
        default:
            return 0;
    }
}

/**
 * @brief 获取UART中断向量
 */
static IRQn_Type UART_GetIRQn(UART_Instance_t instance)
{
    switch (instance) {
        case UART_INSTANCE_1:
            return USART1_IRQn;
        case UART_INSTANCE_2:
            return USART2_IRQn;
        case UART_INSTANCE_3:
            return USART3_IRQn;
        default:
            return (IRQn_Type)0;
    }
}

/**
 * @brief 使能UART中断
 */
UART_Status_t UART_EnableIT(UART_Instance_t instance, UART_IT_t it_type)
{
    USART_TypeDef *uart_periph;
    uint16_t it_value;
    IRQn_Type irqn;
    NVIC_InitTypeDef NVIC_InitStructure;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    it_value = UART_GetITValue(it_type);
    if (it_value == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 使能UART中断 */
    USART_ITConfig(uart_periph, it_value, ENABLE);
    
    /* 使能NVIC中断（如果还没有使能） */
    irqn = UART_GetIRQn(instance);
    if (irqn != 0) {
        NVIC_InitStructure.NVIC_IRQChannel = irqn;
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
        NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
        NVIC_Init(&NVIC_InitStructure);
    }
    
    return UART_OK;
}

/**
 * @brief 禁用UART中断
 */
UART_Status_t UART_DisableIT(UART_Instance_t instance, UART_IT_t it_type)
{
    USART_TypeDef *uart_periph;
    uint16_t it_value;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    it_value = UART_GetITValue(it_type);
    if (it_value == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 禁用UART中断 */
    USART_ITConfig(uart_periph, it_value, DISABLE);
    
    return UART_OK;
}

/**
 * @brief 设置UART中断回调函数
 */
UART_Status_t UART_SetITCallback(UART_Instance_t instance, UART_IT_t it_type,
                                  UART_IT_Callback_t callback, void *user_data)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    /* 注意：callback可以为NULL（表示禁用回调），user_data可以为NULL */
    
    /* 设置回调函数和用户数据 */
    g_uart_it_callbacks[instance][it_type] = callback;
    g_uart_it_user_data[instance][it_type] = user_data;
    
    return UART_OK;
}

/**
 * @brief 获取UART中断状态
 */
uint8_t UART_GetITStatus(UART_Instance_t instance, UART_IT_t it_type)
{
    USART_TypeDef *uart_periph;
    uint16_t it_value;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    if (it_type > UART_IT_CTS) {
        return 0;  /* 无效中断类型返回0 */
    }
    if (!g_uart_initialized[instance]) {
        return 0;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    it_value = UART_GetITValue(it_type);
    if (it_value == 0) {
        return 0;
    }
    
    return (USART_GetITStatus(uart_periph, it_value) != RESET) ? 1 : 0;
}

/**
 * @brief 清除UART中断挂起标志
 */
UART_Status_t UART_ClearITPendingBit(UART_Instance_t instance, UART_IT_t it_type)
{
    USART_TypeDef *uart_periph;
    uint16_t it_value;
    
