mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (it_type > UART_IT_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    it_value = UART_GetITValue(it_type);
    if (it_value == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 清除中断挂起标志 */
    USART_ClearITPendingBit(uart_periph, it_value);
    
    return UART_OK;
}

/**
 * @brief UART非阻塞发送（中断模式）
 */
UART_Status_t UART_TransmitIT(UART_Instance_t instance, const uint8_t *data, uint16_t length)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 检查是否正在发送 */
    if (g_uart_tx_buffer[instance] != NULL) {
        return UART_ERROR_BUSY;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    /* 检查是否正在使用DMA发送 */
    if (DMA_GetRemainingDataSize(uart_tx_dma_channels[instance]) > 0) {
        return UART_ERROR_BUSY;
    }
#endif /* CONFIG_MODULE_DMA_ENABLED */
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 保存发送缓冲区信息 */
    g_uart_tx_buffer[instance] = data;
    g_uart_tx_length[instance] = length;
    g_uart_tx_index[instance] = 0;
    
    /* 优化：立即发送第一个字节（如果发送寄存器为空），减少延迟 */
    if (USART_GetFlagStatus(uart_periph, USART_FLAG_TXE) != RESET) {
        if (length > 0) {
            USART_SendData(uart_periph, data[0]);
            g_uart_tx_index[instance] = 1;
        }
    }
    
    /* 使能TXE中断（发送缓冲区空中断） */
    USART_ITConfig(uart_periph, USART_IT_TXE, ENABLE);
    
    return UART_OK;
}

/**
 * @brief UART非阻塞接收（中断模式）
 */
UART_Status_t UART_ReceiveIT(UART_Instance_t instance, uint8_t *data, uint16_t max_length)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (max_length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 检查是否正在接收 */
    if (g_uart_rx_buffer[instance] != NULL) {
        return UART_ERROR_BUSY;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    /* 检查是否正在使用DMA接收 */
    if (DMA_GetRemainingDataSize(uart_rx_dma_channels[instance]) > 0) {
        return UART_ERROR_BUSY;
    }
#endif /* CONFIG_MODULE_DMA_ENABLED */
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 保存接收缓冲区信息 */
    g_uart_rx_buffer[instance] = data;
    g_uart_rx_max_length[instance] = max_length;
    /* g_uart_rx_length[instance] = 0; */ /* 保留用于未来扩展 */
    g_uart_rx_index[instance] = 0;
    
    /* 使能RXNE中断（接收数据就绪中断） */
    USART_ITConfig(uart_periph, USART_IT_RXNE, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 获取UART发送剩余字节数（中断模式）
 */
uint16_t UART_GetTransmitRemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    if (g_uart_tx_buffer[instance] == NULL) {
        return 0;  /* 没有正在进行的发送 */
    }
    
    return g_uart_tx_length[instance] - g_uart_tx_index[instance];
}

/**
 * @brief 获取UART接收到的字节数（中断模式）
 */
uint16_t UART_GetReceiveCount(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    if (g_uart_rx_buffer[instance] == NULL) {
        return 0;  /* 没有正在进行的接收 */
    }
    
    return g_uart_rx_index[instance];
}

/**
 * @brief UART中断服务函数
 */
void UART_IRQHandler(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    UART_IT_Callback_t callback;
    void *user_data;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return;  /* 无效实例直接返回 */
    }
    
    if (!g_uart_initialized[instance]) {
        return;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 处理发送缓冲区空中断（TXE） */
    if (USART_GetITStatus(uart_periph, USART_IT_TXE) != RESET) {
        if (g_uart_tx_buffer[instance] != NULL) {
            if (g_uart_tx_index[instance] < g_uart_tx_length[instance]) {
                /* 发送下一个字节 */
                USART_SendData(uart_periph, g_uart_tx_buffer[instance][g_uart_tx_index[instance]++]);
            } else {
                /* 发送完成，禁用TXE中断，使能TC中断 */
                USART_ITConfig(uart_periph, USART_IT_TXE, DISABLE);
                USART_ITConfig(uart_periph, USART_IT_TC, ENABLE);
            }
        } else {
            /* 缓冲区指针为NULL但中断已使能，禁用中断（防止异常情况） */
            USART_ITConfig(uart_periph, USART_IT_TXE, DISABLE);
        }
    }
    
    /* 处理发送完成中断（TC） */
    if (USART_GetITStatus(uart_periph, USART_IT_TC) != RESET) {
        USART_ClearITPendingBit(uart_periph, USART_IT_TC);
        USART_ITConfig(uart_periph, USART_IT_TC, DISABLE);
        
        /* 清除发送缓冲区指针 */
        g_uart_tx_buffer[instance] = NULL;
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_TC];
        user_data = g_uart_it_user_data[instance][UART_IT_TC];
        if (callback != NULL) {
            callback(instance, UART_IT_TC, user_data);
        }
    }
    
    /* 处理接收数据就绪中断（RXNE） */
    if (USART_GetITStatus(uart_periph, USART_IT_RXNE) != RESET) {
        if (g_uart_rx_buffer[instance] != NULL) {
            if (g_uart_rx_index[instance] < g_uart_rx_max_length[instance]) {
                /* 接收数据 */
                g_uart_rx_buffer[instance][g_uart_rx_index[instance]++] = (uint8_t)USART_ReceiveData(uart_periph);
                
                /* 调用回调函数 */
                callback = g_uart_it_callbacks[instance][UART_IT_RXNE];
                user_data = g_uart_it_user_data[instance][UART_IT_RXNE];
                if (callback != NULL) {
                    callback(instance, UART_IT_RXNE, user_data);
                }
            } else {
                /* 缓冲区已满，先读取当前数据（避免数据丢失），然后禁用接收中断 */
                /* 注意：即使缓冲区已满，也要读取DR寄存器中的数据，否则会丢失 */
                (void)USART_ReceiveData(uart_periph);
                
                /* 禁用接收中断 */
                USART_ITConfig(uart_periph, USART_IT_RXNE, DISABLE);
                
                /* 调用回调函数通知缓冲区已满 */
                callback = g_uart_it_callbacks[instance][UART_IT_RXNE];
                user_data = g_uart_it_user_data[instance][UART_IT_RXNE];
                if (callback != NULL) {
                    callback(instance, UART_IT_RXNE, user_data);
                }
                
