mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
                g_uart_rx_buffer[instance] = NULL;
            }
        } else {
            /* 没有接收缓冲区，读取并丢弃数据 */
            (void)USART_ReceiveData(uart_periph);
        }
    }
    
    /* 处理空闲中断（IDLE） */
    /* 注意：IDLE标志需要通过读取SR寄存器然后读取DR寄存器来清除 */
    if (USART_GetITStatus(uart_periph, USART_IT_IDLE) != RESET) {
        /* 清除IDLE标志：读取SR寄存器，然后读取DR寄存器 */
        (void)USART_GetITStatus(uart_periph, USART_IT_IDLE);
        (void)USART_ReceiveData(uart_periph);
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_IDLE];
        user_data = g_uart_it_user_data[instance][UART_IT_IDLE];
        if (callback != NULL) {
            callback(instance, UART_IT_IDLE, user_data);
        }
    }
    
    /* 处理奇偶校验错误中断（PE） */
    /* 注意：PE标志需要通过读取SR寄存器然后读取DR寄存器来清除 */
    if (USART_GetITStatus(uart_periph, USART_IT_PE) != RESET) {
        /* 清除PE标志：读取SR寄存器，然后读取DR寄存器 */
        (void)USART_GetITStatus(uart_periph, USART_IT_PE);
        (void)USART_ReceiveData(uart_periph);
        
        /* 错误发生时，停止正在进行的接收（中断模式） */
        if (g_uart_rx_buffer[instance] != NULL) {
            /* 停止接收 */
            USART_ITConfig(uart_periph, USART_IT_RXNE, DISABLE);
            g_uart_rx_buffer[instance] = NULL;
        }
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_PE];
        user_data = g_uart_it_user_data[instance][UART_IT_PE];
        if (callback != NULL) {
            callback(instance, UART_IT_PE, user_data);
        }
    }
    
    /* 处理错误中断（ORE、NE、FE） */
    /* 注意：ORE、NE、FE中断标志需要通过读取SR寄存器然后读取DR寄存器来清除 */
    /* 优化：先读取一次状态寄存器，然后根据标志位清除 */
    if (USART_GetITStatus(uart_periph, USART_IT_ORE) != RESET ||
        USART_GetITStatus(uart_periph, USART_IT_NE) != RESET ||
        USART_GetITStatus(uart_periph, USART_IT_FE) != RESET) {
        /* 读取SR寄存器（清除标志的第一步） */
        (void)uart_periph->SR;
        /* 读取DR寄存器（清除标志的第二步） */
        (void)USART_ReceiveData(uart_periph);
        
        /* 错误发生时，停止正在进行的传输（中断模式） */
        if (g_uart_tx_buffer[instance] != NULL) {
            /* 停止发送 */
            USART_ITConfig(uart_periph, USART_IT_TXE, DISABLE);
            USART_ITConfig(uart_periph, USART_IT_TC, DISABLE);
            g_uart_tx_buffer[instance] = NULL;
        }
        if (g_uart_rx_buffer[instance] != NULL) {
            /* 停止接收 */
            USART_ITConfig(uart_periph, USART_IT_RXNE, DISABLE);
            g_uart_rx_buffer[instance] = NULL;
        }
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_ERR];
        user_data = g_uart_it_user_data[instance][UART_IT_ERR];
        if (callback != NULL) {
            callback(instance, UART_IT_ERR, user_data);
        }
    }
    
    /* 处理LIN断点检测中断（LBD） */
    if (USART_GetITStatus(uart_periph, USART_IT_LBD) != RESET) {
        USART_ClearITPendingBit(uart_periph, USART_IT_LBD);
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_LBD];
        user_data = g_uart_it_user_data[instance][UART_IT_LBD];
        if (callback != NULL) {
            callback(instance, UART_IT_LBD, user_data);
        }
    }
    
    /* 处理CTS中断 */
    if (USART_GetITStatus(uart_periph, USART_IT_CTS) != RESET) {
        USART_ClearITPendingBit(uart_periph, USART_IT_CTS);
        
        /* 调用回调函数 */
        callback = g_uart_it_callbacks[instance][UART_IT_CTS];
        user_data = g_uart_it_user_data[instance][UART_IT_CTS];
        if (callback != NULL) {
            callback(instance, UART_IT_CTS, user_data);
        }
    }
}

/* 注意：UART中断服务程序入口（USART1_IRQHandler等）在Core/stm32f10x_it.c中实现 */


/* ========== DMA模式功能实现 ========== */

/**
 * @brief UART DMA发送
 */
UART_Status_t UART_TransmitDMA(UART_Instance_t instance, const uint8_t *data, uint16_t length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    USART_TypeDef *uart_periph;
    DMA_Channel_t dma_channel;
    DMA_Status_t dma_status;
    
    /* 检查是否正在使用中断模式发送 */
    if (g_uart_tx_buffer[instance] != NULL) {
        return UART_ERROR_BUSY;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    dma_channel = uart_tx_dma_channels[instance];
    
    /* 检查DMA通道是否已初始化 */
    if (!DMA_IsInitialized(dma_channel)) {
        dma_status = DMA_HW_Init(dma_channel);
        if (dma_status != DMA_OK) {
            return UART_ERROR_INVALID_PARAM;
        }
    }
    
    /* 停止之前的传输 */
    DMA_Stop(dma_channel);
    
    /* 配置DMA传输（内存到外设） */
    dma_status = DMA_ConfigTransfer(dma_channel, (uint32_t)&uart_periph->DR,
                                    (uint32_t)data, length,
                                    DMA_DIR_MEMORY_TO_PERIPHERAL, 1);
    if (dma_status != DMA_OK) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 使能UART DMA发送请求 */
    USART_DMACmd(uart_periph, USART_DMAReq_Tx, ENABLE);
    
    /* 启动DMA传输 */
    dma_status = DMA_Start(dma_channel);
    if (dma_status != DMA_OK) {
        USART_DMACmd(uart_periph, USART_DMAReq_Tx, DISABLE);
        return UART_ERROR_INVALID_PARAM;
    }
    
    return UART_OK;
#else
    return UART_ERROR_NOT_IMPLEMENTED;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/**
 * @brief UART DMA接收
 */
UART_Status_t UART_ReceiveDMA(UART_Instance_t instance, uint8_t *data, uint16_t length)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (data == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (length == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    USART_TypeDef *uart_periph;
    DMA_Channel_t dma_channel;
    DMA_Status_t dma_status;
    
    /* 检查是否正在使用中断模式接收 */
    if (g_uart_rx_buffer[instance] != NULL) {
        return UART_ERROR_BUSY;
    }
    
