mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    uart_periph = g_uart_configs[instance].uart_periph;
    dma_channel = uart_rx_dma_channels[instance];
    
    /* 检查DMA通道是否已初始化 */
    if (!DMA_IsInitialized(dma_channel)) {
        dma_status = DMA_HW_Init(dma_channel);
        if (dma_status != DMA_OK) {
            return UART_ERROR_INVALID_PARAM;
        }
    }
    
    /* 停止之前的传输 */
    DMA_Stop(dma_channel);
    
    /* 配置DMA传输（外设到内存） */
    dma_status = DMA_ConfigTransfer(dma_channel, (uint32_t)&uart_periph->DR,
                                    (uint32_t)data, length,
                                    DMA_DIR_PERIPHERAL_TO_MEMORY, 1);
    if (dma_status != DMA_OK) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 使能UART DMA接收请求 */
    USART_DMACmd(uart_periph, USART_DMAReq_Rx, ENABLE);
    
    /* 启动DMA传输 */
    dma_status = DMA_Start(dma_channel);
    if (dma_status != DMA_OK) {
        USART_DMACmd(uart_periph, USART_DMAReq_Rx, DISABLE);
        return UART_ERROR_INVALID_PARAM;
    }
    
    return UART_OK;
#else
    return UART_ERROR_NOT_IMPLEMENTED;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/**
 * @brief 停止UART DMA发送
 */
UART_Status_t UART_StopTransmitDMA(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    USART_TypeDef *uart_periph;
    DMA_Channel_t dma_channel;
    
    uart_periph = g_uart_configs[instance].uart_periph;
    dma_channel = uart_tx_dma_channels[instance];
    
    /* 禁用UART DMA发送请求 */
    USART_DMACmd(uart_periph, USART_DMAReq_Tx, DISABLE);
    
    /* 停止DMA传输 */
    DMA_Stop(dma_channel);
    
    return UART_OK;
#else
    return UART_ERROR_NOT_IMPLEMENTED;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/**
 * @brief 停止UART DMA接收
 */
UART_Status_t UART_StopReceiveDMA(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    USART_TypeDef *uart_periph;
    DMA_Channel_t dma_channel;
    
    uart_periph = g_uart_configs[instance].uart_periph;
    dma_channel = uart_rx_dma_channels[instance];
    
    /* 禁用UART DMA接收请求 */
    USART_DMACmd(uart_periph, USART_DMAReq_Rx, DISABLE);
    
    /* 停止DMA传输 */
    DMA_Stop(dma_channel);
    
    return UART_OK;
#else
    return UART_ERROR_NOT_IMPLEMENTED;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/**
 * @brief 获取UART DMA发送剩余字节数
 */
uint16_t UART_GetTransmitDMARemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    DMA_Channel_t dma_channel;
    dma_channel = uart_tx_dma_channels[instance];
    return DMA_GetRemainingDataSize(dma_channel);
#else
    return 0;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/**
 * @brief 获取UART DMA接收剩余字节数
 */
uint16_t UART_GetReceiveDMARemaining(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
#if CONFIG_MODULE_DMA_ENABLED
    DMA_Channel_t dma_channel;
    dma_channel = uart_rx_dma_channels[instance];
    return DMA_GetRemainingDataSize(dma_channel);
#else
    return 0;
#endif /* CONFIG_MODULE_DMA_ENABLED */
}

/* ========== 硬件流控功能实现 ========== */

/**
 * @brief 配置UART硬件流控
 */
UART_Status_t UART_SetHardwareFlowControl(UART_Instance_t instance, UART_HW_FlowControl_t flow_control)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (flow_control > UART_HW_FLOW_RTS_CTS) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 保存配置 */
    g_uart_hw_flow[instance] = flow_control;
    
    /* 注意：硬件流控配置需要在UART_Init()中应用 */
    /* 如果UART已经初始化，需要先调用UART_Deinit()，然后重新调用UART_Init()来应用新配置 */
    
    return UART_OK;
}

/**
 * @brief 获取UART硬件流控配置
 */
UART_Status_t UART_GetHardwareFlowControl(UART_Instance_t instance, UART_HW_FlowControl_t *flow_control)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (flow_control == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    *flow_control = g_uart_hw_flow[instance];
    
    return UART_OK;
}

/* ========== 单线半双工模式功能实现 ========== */

/**
 * @brief 使能UART单线半双工模式
 */
UART_Status_t UART_EnableHalfDuplex(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 使能单线半双工模式 */
    USART_HalfDuplexCmd(uart_periph, ENABLE);
    
    /* 标记为单线模式 */
    g_uart_half_duplex[instance] = true;
    
    return UART_OK;
}

/**
 * @brief 禁用UART单线半双工模式
 */
UART_Status_t UART_DisableHalfDuplex(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用单线半双工模式 */
    USART_HalfDuplexCmd(uart_periph, DISABLE);
    
    /* 标记为全双工模式 */
    g_uart_half_duplex[instance] = false;
    
    return UART_OK;
}

/**
 * @brief 检查UART是否处于单线半双工模式
 */
uint8_t UART_IsHalfDuplex(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return 0;  /* 无效实例返回0 */
    }
    
    return g_uart_half_duplex[instance] ? 1 : 0;
}

/* ========== LIN/IrDA/智能卡模式功能实现 ========== */

/**
 * @brief 使能UART LIN模式
 */
UART_Status_t UART_EnableLINMode(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
