mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 使能LIN模式 */
    USART_LINCmd(uart_periph, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 禁用UART LIN模式
 */
UART_Status_t UART_DisableLINMode(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用LIN模式 */
    USART_LINCmd(uart_periph, DISABLE);
    
    return UART_OK;
}

/**
 * @brief 发送LIN断点字符
 */
UART_Status_t UART_SendBreak(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 发送LIN断点字符 */
    USART_SendBreak(uart_periph);
    
    return UART_OK;
}

/**
 * @brief 使能UART IrDA模式
 */
UART_Status_t UART_EnableIrDAMode(UART_Instance_t instance, uint8_t prescaler)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (prescaler == 0 || prescaler > 31) {
        return UART_ERROR_INVALID_PARAM;  /* IrDA预分频器范围：1-31 */
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 配置IrDA预分频器 */
    USART_SetPrescaler(uart_periph, prescaler);
    
    /* 配置IrDA模式（正常模式） */
    USART_IrDAConfig(uart_periph, USART_IrDAMode_Normal);
    
    /* 使能IrDA模式 */
    USART_IrDACmd(uart_periph, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 禁用UART IrDA模式
 */
UART_Status_t UART_DisableIrDAMode(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用IrDA模式 */
    USART_IrDACmd(uart_periph, DISABLE);
    
    return UART_OK;
}

/**
 * @brief 使能UART智能卡模式
 */
UART_Status_t UART_EnableSmartCardMode(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 使能智能卡模式 */
    USART_SmartCardCmd(uart_periph, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 禁用UART智能卡模式
 */
UART_Status_t UART_DisableSmartCardMode(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用智能卡模式 */
    USART_SmartCardCmd(uart_periph, DISABLE);
    
    return UART_OK;
}

/* ========== UART高级功能实现 ========== */

/**
 * @brief 使能UART自动波特率检测
 * @note STM32F10x SPL库不直接支持自动波特率检测，此功能需要通过软件实现
 * @note 当前实现为占位函数，返回NOT_IMPLEMENTED
 */
UART_Status_t UART_EnableAutoBaudRate(UART_Instance_t instance, UART_AutoBaudMode_t mode)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (mode > UART_AUTOBAUD_MODE_FALLING_EDGE) {
        return UART_ERROR_INVALID_PARAM;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 注意：STM32F10x SPL库不直接支持自动波特率检测 */
    /* 此功能需要通过软件实现（测量起始位宽度或下降沿间隔） */
    /* 当前实现为占位函数，待后续完善 */
    
    (void)mode;  /* 避免未使用参数警告 */
    
    return UART_ERROR_NOT_IMPLEMENTED;
}

/**
 * @brief 禁用UART自动波特率检测
 */
UART_Status_t UART_DisableAutoBaudRate(UART_Instance_t instance)
{
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    /* 注意：自动波特率检测功能未实现，此函数仅用于接口完整性 */
    
    return UART_OK;
}

/**
 * @brief 使能UART接收器唤醒
 */
UART_Status_t UART_EnableReceiverWakeUp(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 使能接收器唤醒 */
    USART_ReceiverWakeUpCmd(uart_periph, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 禁用UART接收器唤醒
 */
UART_Status_t UART_DisableReceiverWakeUp(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用接收器唤醒 */
    USART_ReceiverWakeUpCmd(uart_periph, DISABLE);
    
    return UART_OK;
}

/**
 * @brief 使能UART 8倍过采样
 */
UART_Status_t UART_EnableOverSampling8(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
