mdbsliguo/stm32_template_SPL/Drivers/uart/uart.c
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 注意：8倍过采样需要在UART初始化前配置（在USART_Init之前） */
    /* 如果UART已经初始化，需要先禁用UART，配置过采样，然后重新初始化 */
    /* 这里仅提供接口，实际使用时需要在UART_Init中根据配置设置 */
    
    /* 使能8倍过采样 */
    USART_OverSampling8Cmd(uart_periph, ENABLE);
    
    return UART_OK;
}

/**
 * @brief 禁用UART 8倍过采样（使用16倍过采样）
 */
UART_Status_t UART_DisableOverSampling8(UART_Instance_t instance)
{
    USART_TypeDef *uart_periph;
    
    /* ========== 参数校验 ========== */
    if (instance >= UART_INSTANCE_MAX) {
        return UART_ERROR_INVALID_INSTANCE;
    }
    if (!g_uart_initialized[instance]) {
        return UART_ERROR_NOT_INITIALIZED;
    }
    
    uart_periph = g_uart_configs[instance].uart_periph;
    
    /* 禁用8倍过采样（使用16倍过采样） */
    USART_OverSampling8Cmd(uart_periph, DISABLE);
    
    return UART_OK;
}

/**
 * @brief 动态修改UART波特率（不重新初始化）
 * @param[in] uart_periph UART外设指针（USART1/USART2/USART3）
 * @param[in] baudrate 目标波特率
 * @return UART_Status_t 错误码
 * @note 此函数直接修改BRR寄存器，执行时间 < 1μs
 * @note 不影响UART其他配置（数据位、停止位等）
 * @note 不丢失发送/接收状态
 */
UART_Status_t UART_SetBaudRate(USART_TypeDef *uart_periph, uint32_t baudrate)
{
    uint32_t clock;
    uint16_t brr;
    RCC_ClocksTypeDef RCC_ClocksStatus;
    
    /* ========== 参数校验 ========== */
    if (uart_periph == NULL) {
        return UART_ERROR_NULL_PTR;
    }
    
    if (baudrate == 0) {
        return UART_ERROR_INVALID_PARAM;
    }
    
    /* 获取当前UART的PCLK时钟频率 */
    RCC_GetClocksFreq(&RCC_ClocksStatus);
    
    /* 某些UART在APB2（如USART1） */
    if (uart_periph == USART1) {
        clock = RCC_ClocksStatus.PCLK2_Frequency;  /* USART1使用PCLK2 */
    } else {
        clock = RCC_ClocksStatus.PCLK1_Frequency;  /* USART2/3使用PCLK1 */
    }
    
    /* 计算分频系数（STM32F1系列: BRR = PCLK / baudrate，四舍五入） */
    brr = (clock + baudrate / 2) / baudrate;  /* 四舍五入 */
    
    /* 关键：等待发送完成 */
    while (USART_GetFlagStatus(uart_periph, USART_FLAG_TC) == RESET);
    
    /* 关键：等待接收完成（如果有数据在接收） */
    while (USART_GetFlagStatus(uart_periph, USART_FLAG_RXNE) == SET) {
        volatile uint8_t dummy = USART_ReceiveData(uart_periph);
        (void)dummy;
    }
    
    /* 关闭UART（短暂关闭，防止写入时数据错乱） */
    uart_periph->CR1 &= ~USART_CR1_UE;
    
    /* 写入新波特率分频值 */
    uart_periph->BRR = brr;
    
    /* 重新使能UART */
    uart_periph->CR1 |= USART_CR1_UE;
    
    return UART_OK;
}

#endif /* CONFIG_MODULE_UART_ENABLED */
